In [4]:
import pandas as pd

# JOIN

In [5]:
var1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3']}, index=[0, 1, 2, 3])
var1
var2 = pd.DataFrame({
    'D': ['A4', 'A5', 'A6'],
    'E': ['B4', 'B5', 'B6'],
    'C': ['C4', 'C5', 'C6']}, index=[0, 1, 2])
var2

    D   E   C
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6

In [6]:
var1.join(var2, how='outer', lsuffix="_12") # JOIN using left method it will keep all the rows from left dataframe, inner method will keep only the common rows

    A   B C_12    D    E    C
0  A0  B0   C0   A4   B4   C4
1  A1  B1   C1   A5   B5   C5
2  A2  B2   C2   A6   B6   C6
3  A3  B3   C3  NaN  NaN  NaN

# PIVOT TABLE & MELT FUNCTION
### MELT

In [7]:
var3 = pd.DataFrame({
    "days":[1,2,3,4,5,6],
    "eng":[30,40,50,20,10,60],
    "maths":[35,45,55,25,15,65],
    "science":[32,42,52,22,12,62]

    })

var3

   days  eng  maths  science
0     1   30     35       32
1     2   40     45       42
2     3   50     55       52
3     4   20     25       22
4     5   10     15       12
5     6   60     65       62

In [8]:
pd.melt(var3, id_vars=["days"], var_name="subject", value_name="marks")

    days  subject  marks
0      1      eng     30
1      2      eng     40
2      3      eng     50
3      4      eng     20
4      5      eng     10
5      6      eng     60
6      1    maths     35
7      2    maths     45
8      3    maths     55
9      4    maths     25
10     5    maths     15
11     6    maths     65
12     1  science     32
13     2  science     42
14     3  science     52
15     4  science     22
16     5  science     12
17     6  science     62

## PIVOT()

In [17]:
var3 = pd.DataFrame({
    "days":[1,2,3,4,5,6],
    "st_name": ['a','b','c','d','e','b'],
    "eng":[30,40,50,20,10,60],
    "maths":[35,45,55,25,15,65],
    "science":[32,42,52,22,12,62]
})

var3

   days st_name  eng  maths  science
0     1       a   30     35       32
1     2       b   40     45       42
2     3       c   50     55       52
3     4       d   20     25       22
4     5       e   10     15       12
5     6       b   60     65       62

In [10]:
var3.pivot(index="days", columns="st_name",values="eng")

st_name     a     b     c     d     e
days
1        30.0   NaN   NaN   NaN   NaN
2         NaN  40.0   NaN   NaN   NaN
3         NaN   NaN  50.0   NaN   NaN
4         NaN   NaN   NaN  20.0   NaN
5         NaN   NaN   NaN   NaN  10.0
6         NaN  60.0   NaN   NaN   NaN

In [11]:
var3.pivot(index="days", columns="st_name")

          eng                         maths                         science  \
st_name     a     b     c     d     e     a     b     c     d     e       a
days
1        30.0   NaN   NaN   NaN   NaN  35.0   NaN   NaN   NaN   NaN    32.0
2         NaN  40.0   NaN   NaN   NaN   NaN  45.0   NaN   NaN   NaN     NaN
3         NaN   NaN  50.0   NaN   NaN   NaN   NaN  55.0   NaN   NaN     NaN
4         NaN   NaN   NaN  20.0   NaN   NaN   NaN   NaN  25.0   NaN     NaN
5         NaN   NaN   NaN   NaN  10.0   NaN   NaN   NaN   NaN  15.0     NaN
6         NaN  60.0   NaN   NaN   NaN   NaN  65.0   NaN   NaN   NaN     NaN


st_name     b     c     d     e
days
1         NaN   NaN   NaN   NaN
2        42.0   NaN   NaN   NaN
3         NaN  52.0   NaN   NaN
4         NaN   NaN  22.0   NaN
5         NaN   NaN   NaN  12.0
6        62.0   NaN   NaN   NaN